{
    "List": [
        {
            "Title": "CaptchaForge",
            "UrlImg": "https://raw.githubusercontent.com/Drymnz/CaptchaForge/refs/heads/dev-app/Recursos/2024-10-28-001654_1366x741_scrot.png",
            "Description": "Este proyecto fue desarrollado para interpretar un lenguaje de CC, que incluye etiquetas para convertir a HTML y JS. Además, cuenta con su propio lenguaje de scripting para el uso en la página web. Utiliza Angular 18 para realizar peticiones a una API de Spring Boot.",
            "UseTechnology": "Angular 18 y Spring Boot",
            "Link": "https://github.com/Drymnz/CaptchaForge"
        },
        {
            "Title": "WebXsonQuiz",
            "UrlImg": "https://raw.githubusercontent.com/Drymnz/WebXsonQuiz/refs/heads/main/recursos-git/img_001.png",
            "Description": "Su función principal es la creación de trivias consumidas por una aplicación Android en código Kotlin, utilizando comunicación a través de sockets. Además, cuenta con una parte web encargada de crear, modificar y eliminar trivias y sus componentes, así como de realizar lecturas en SQLKV, un lenguaje creado específicamente para el proyecto.",
            "UseTechnology": "Kotlin y Java\"Socket\"",
            "Link": "https://github.com/Drymnz/WebXsonQuiz"
        },
        {
            "Title": "GrammarGeomCalc",
            "UrlImg": "https://raw.githubusercontent.com/Drymnz/Practica-Compi-1-Graficador-2024-S2/main/recursos-git/Screenshot_Proyect.png",
            "Description": "Con este proyecto, aprendí el desarrollo de una aplicación utilizando Java Swing. Para su implementación, empleé dos herramientas: JFlex y CUP, las cuales se utilizaron para la interpretación del análisis léxico y sintáctico, respectivamente.",
            "UseTechnology": "Java",
            "Link": "https://github.com/Drymnz/Practica-Compi-1-Graficador-2024-S2"
        },
        {
            "Title": "My-setting-awesome-wm",
            "UrlImg": "https://raw.githubusercontent.com/Drymnz/My-setting-awesome-wm/main/recursos-git/00_1366x768_scrot.png",
            "Description": "Es un proyecto personal que comencé para aprender Linux. Consistió en la instalación de Arch Linux utilizando únicamente comandos, seguida de la configuración de un escritorio personalizado con gestor de ventanas en mosaico (tiling window manager).",
            "UseTechnology": "Bash",
            "Link": "https://github.com/Drymnz/My-setting-awesome-wm/tree/main"
        },
        {
            "Title": "Mini-SQL-Practica",
            "UrlImg": "",
            "Description": "Esta aplicación en Angular implementa un analizador léxico, sintáctico y semántico para SQL. Interpreta la estructura de SQL y ejecuta algunas funcionalidades, utilizando Angular para una interfaz de usuario dinámica y eficiente.",
            "UseTechnology": "Angular",
            "Link": "https://github.com/Drymnz/Mini-SQL-Practica"
        }
        ,
        {
            "Title": "Proyecto-Boxworld-Sokoban-Compiladores",
            "UrlImg": "https://raw.githubusercontent.com/Drymnz/Proyecto-Boxworld-Sokoban-Compiladores/main/recursos-git/imagen_tres.jpg",
            "Description": "Aplicación Android desarrollada como proyecto universitario para análisis sintáctico. Implementa generación dinámica de mapas mediante interacción con socket Java. El dispositivo móvil envía instrucciones de mapeo, y el socket responde con indicaciones para construir el mapa en la aplicación.",
            "UseTechnology": "Kotlin y Java\"Socket\"",
            "Link": "https://github.com/Drymnz/Proyecto-Boxworld-Sokoban-Compiladores"
        }
        
    ]
}